app/controllers/articles_controller.rb

  def index
    @article = Article.all
---
SELECT "articles".* FROM "articles"

  def create
    @article = Article.new(article_params)
    if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "w"], ["text", "w"], ["created_at", 2016-10-09 13:06:32 UTC], ["updated_at", 2016-10-09 13:06:32 UTC]]

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "w33"], ["text", "w23"], ["updated_at", 2016-10-09 15:20:36 UTC], ["id", 1]]

  def destroy
    @article = Article.find(params[:id])
    @article.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 2]]